{"keras_version": "1.2.2", "config": [{"config": {"output_shape": null, "function_type": "lambda", "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "name": "lambda_2", "trainable": true, "input_dtype": "float32", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-944067406ed4>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"W_constraint": null, "init": "he_normal", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 1, "border_mode": "valid", "W_regularizer": null, "nb_filter": 3, "b_constraint": null, "name": "conv0", "b_regularizer": null, "bias": true, "nb_col": 1, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "init": "he_normal", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 32, "b_constraint": null, "name": "conv1", "b_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "init": "he_normal", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 32, "b_constraint": null, "name": "conv2", "b_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_11"}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_4", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "init": "he_normal", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "name": "conv3", "b_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_12"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "init": "he_normal", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "name": "conv4", "b_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_13"}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_5", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "init": "he_normal", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 128, "b_constraint": null, "name": "conv5", "b_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_14"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "init": "he_normal", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 128, "b_constraint": null, "name": "conv6", "b_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_15"}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_6", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_9"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "output_dim": 512, "init": "he_normal", "activity_regularizer": null, "name": "hidden1", "input_dim": 2048, "W_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_16"}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_10"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "output_dim": 64, "init": "he_normal", "activity_regularizer": null, "name": "hidden2", "input_dim": 512, "W_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_17"}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_11"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "output_dim": 16, "init": "he_normal", "activity_regularizer": null, "name": "hidden3", "input_dim": 64, "W_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_18"}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_12"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "output_dim": 1, "init": "he_normal", "activity_regularizer": null, "name": "output", "input_dim": 16, "W_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}